def nod_bin(a, b):
    g = 1

    while a % 2 == 0 and b % 2 == 0:
        a = a // 2
        b = b // 2
        g = 2 * g

    u = a
    v = b
    A = 1
    B = 0
    C = 0
    D = 1

    i = 1
    while u != 0:
        while u % 2 == 0:
            u = u // 2
            if A % 2 == 0 and B % 2 == 0:
                A = A // 2
                B = B // 2
            else: # докидываем 
                A = (A + b) // 2
                B = (B - a) // 2

        while v % 2 == 0:
            v = v // 2

            if C % 2 == 0 and D % 2 == 0:
                C = C // 2
                D = D // 2
            else: # докидываем
                C = (C + b) // 2
                D = (D - a) // 2

        if u >= v:
            u = u - v
            A = A - C
            B = B - D
            print(f"{i} : {u} {A} {B}")
        else:
            v = v - u
            C = C - A
            D = D - B
            print(f"{i} : {v} {C} {D}")

        i += 1

    d = g * v
    x = C
    y = D

    return d, x, y


print("1.")
print(nod_bin(76442254787382549361, 10839626249153696837))

print("\n2.")
print(
    nod_bin(
        1185424818577499562119347302107269112893,
        446596617388872800391921394077531729451,
    )
)

print("\n3.")
print(
    nod_bin(
        16044312434096626538807819619243235254916564726186151279138828221183369568517841,
        97459036020809271505326192941985473863968504093300413836237675803378577076822423,
    )
)