**Мой вариант: 58 число вершин графа, 2 - алгоритм Прима, 17 - стартовая вершина для алгоритма.**
1. Написать программу, которая будет считывать файл (в файле находится матрица весов, в которой значение 0 - отсутствие ребра), а именно 58 строк после первой строки. [[Шаг 1. Считать матрицу графа]]
2. Матрица весов [[Шаг 2. Матрица весов это]]
3. Найти 17 вершину (т.к. в варианте нужно начать с нее) [[Шаг 3. Стартовая вершина]]
4. Сделать поиск минимального веса среди матрицы [[Шаг 4. Поиск следующей вершины]]
5. Добавить новою вершину в матрицу [[Шаг 5. Добавление новой вершины]]
6. Отследить пути, которые появляются на каждом шаге (для вывода по ТЗ) [[Шаг 6. Отслеживание путей (оставов)]]
7. Вывод printf (отладка)
8. Посчитать итоговую сумму веса графа [[Шаг 8. Посчитать итоговую суммму]]
9. Сл